# GetNumberOfLightTypes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightFamily..::..GetNumberOfLightTypes Method
LightFamily Class See Also
---
Return the number of light types contained in this light family
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetNumberOfLightTypes()
```

Visual Basic
---
```text
Public Function GetNumberOfLightTypes As Integer
```

Visual C++
---
```text
public:
int GetNumberOfLightTypes()
```

# ### Return Value
The number of light types contained in this light family
# See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace